app/Controllers/AdminController.php

    public function index()
    {
        $projectModel = new Project();
        $projects = $projectModel->findAll(); // Fetch all users
---
SELECT *
FROM `projects`

    public function viewAllTasksOfUser()
    {
        $userId = session()->get('user_id');
        $item = new Task();
        $items = $item->where('users_user_id', $userId)->findAll();
---
SELECT *
FROM `tasks`
WHERE `users_user_id` = '1'

    public function search()
{
    $keyword = $this->request->getGet('keyword');
    $projectModel = new Project();
    $userModel = new User();
    $taskModel = new Task();

    $projects = [];
    $users = [];
    $tasks = [];

    if ($keyword) {
        // Search Projects
        $projects = $projectModel->like('title', $keyword)
                                 ->orLike('company', $keyword)
                                 ->findAll();
        foreach ($projects as &$project) {
            // Fetch tasks for the current project
            $project['tasks'] = $taskModel->getTasksByProject($project['project_id']);

            // Get the count of all tasks for the current project
            $project['task_count'] = count($project['tasks']);

            // Get the count of finished tasks for the current project
            $project['finished_task_count'] = $taskModel->getFinishedTaskCount($project['project_id']);
        }

        // Search Users
        $users = $userModel->like('username', $keyword)
                           ->orLike('email', $keyword)
                           ->findAll();

        // Search Tasks
        $tasks = $taskModel->groupStart()
                           ->like('title', $keyword)
                           ->orLike('description', $keyword)
                           ->groupEnd()
                           ->findAll();
---
SELECT *
FROM `projects`
WHERE `title` LIKE '%web%' ESCAPE '!'
OR  `company` LIKE '%web%' ESCAPE '!'
SELECT *
FROM `users`
WHERE `username` LIKE '%web%' ESCAPE '!'
OR  `email` LIKE '%web%' ESCAPE '!'
SELECT *
FROM `tasks`
WHERE   (
`title` LIKE '%web%' ESCAPE '!'
OR  `description` LIKE '%web%' ESCAPE '!'
 )