app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'suraweeraadikari@gmail.com'
 LIMIT 1
---
    public function attemptLogin()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Validate input
        $validated = $this->validate([
            'email' => 'required|valid_email',
            'password' => 'required',
        ]);

        if (!$validated) {
            return redirect()->back()->withInput()->with('error', 'Invalid credentials.');
        }

        // Check user credentials
        $userModel = new User();
        $user = $userModel->where('email', $email)->first();