app/Controllers/ProjectController.php

SELECT *
FROM `users`
SELECT *
FROM `projects`
WHERE `projects`.`project_id` = '6'
---
    public function view($id)
    {
        $projectModel = new Project();
        $taskModel = new Task();
        $userModel = new User();
        $users = $userModel->findAll();

        $project = $projectModel->find($id);