app/Controllers/TaskController.php

SELECT *
FROM `tasks`
WHERE `tasks`.`task_id` = '13'
UPDATE `tasks` SET `title` = 'back end Development', `description` = 'use Laravel as framework\r\nuse jquery', `estimated_time` = '8h', `importance_status` = 'Medium', `status` = 'finished', `due_date` = '2024-07-24', `users_user_id` = '1', `projects_project_id` = '6'
WHERE `tasks`.`task_id` IN ('13')
---
    public function finish($id)
    {
        $taskModel = new Task();
        $task = $taskModel->find($id);
        if ($task) {
            $task['status'] = 'finished';
            $taskModel->update($id, $task);

SELECT *
FROM `tasks`
WHERE `users_user_id` = '1'
AND   (
`title` LIKE '%chama%' ESCAPE '!'
OR  `description` LIKE '%chama%' ESCAPE '!'
 )
---
    public function UserTaskSearch()
    {
        $keyword = $this->request->getGet('keyword');
        $userId = session()->get('user_id');
        $taskModel = new Task();
        if ($keyword) {
            $tasks = $taskModel->where('users_user_id', $userId)
                               ->groupStart()
                               ->like('title', $keyword)
                               ->orLike('description', $keyword)
                               ->groupEnd()
                               ->findAll();