app/Models/Task.php

    public function getTasksByProject($projectId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tasks');
        $builder->select('tasks.*');
        $builder->where('projects_project_id', $projectId);
        $query = $builder->get();
---
SELECT `tasks`.*
FROM `tasks`
WHERE `projects_project_id` = '6'